In [2]:
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
import category_encoders as ce
from sklearn.linear_model import LinearRegression
import numpy as np

In [6]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.7-py2.py3-none-any.whl (243 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.7
WARNING: You are using pip version 21.0.1; however, version 21.1.1 is available.
You should consider upgrading via the 'c:\users\admin\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

In [11]:
!dir ..\Kaggle_dataset\Cleaned_2018_Flights.csv

 Volume in drive G is G
 Volume Serial Number is 1C7D-A999

 Directory of g:\xasm\FTDS_GitHub\Kaggle_dataset

11/16/2019  03:15 PM       716,070,191 Cleaned_2018_Flights.csv
               1 File(s)    716,070,191 bytes
               0 Dir(s)  10,395,222,016 bytes free

In [20]:
df = pd.read_csv('../Kaggle_dataset/Cleaned_2018_Flights.csv')

In [7]:
app_df = pd.read_excel('Airport Rankings 2018.xlsx',header=2,usecols=[0,1])

In [8]:
app_df.iloc[0:5,:]

  2018 Rank            Airport
0         1            Atlanta
1         2        Los Angeles
2         3     Chicago O'Hare
3         4  Dallas/Fort Worth
4         5             Denver

In [9]:
app_df2 = pd.read_excel('Airport Rankings 2018.xlsx',sheet_name=3,header=4,usecols=[0,1,2])

In [10]:
app_df2.head()

   Unnamed: 0                                            Airport Code
0         1.0         Los Angeles, CA: Los Angeles International  LAX
1         2.0          Chicago, IL: Chicago O'Hare International  ORD
2         3.0                   Denver, CO: Denver International  DEN
3         4.0  Atlanta, GA: Hartsfield-Jackson Atlanta Intern...  ATL
4         5.0     San Francisco, CA: San Francisco International  SFO

In [11]:
app_df2['Airport'] = app_df2['Airport'].apply(lambda x: x.split(',')[0])

In [12]:
app_df2.head()

   Unnamed: 0        Airport Code
0         1.0    Los Angeles  LAX
1         2.0        Chicago  ORD
2         3.0         Denver  DEN
3         4.0        Atlanta  ATL
4         5.0  San Francisco  SFO

In [17]:
app_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414 entries, 0 to 413
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  413 non-null    float64
 1   Airport     414 non-null    object
 2   Code        413 non-null    object
dtypes: float64(1), object(2)
memory usage: 9.8+ KB

In [18]:
df_s = app_df.merge(app_df2[['Airport','Code']],how='left',left_on='Airport',right_on='Airport')

In [21]:
df_s = df_s.iloc[:-3,:]
df_s

    2018 Rank                    Airport Code
0           1                    Atlanta  ATL
1           2                Los Angeles  LAX
2           3             Chicago O'Hare  NaN
3           4          Dallas/Fort Worth  DFW
4           5                     Denver  DEN
..        ...                        ...  ...
213       196  Jacksonville/Camp Lejeune  OAJ
214       197                    Latrobe  LBE
215       198                      Minot  MOT
216       199                    Lincoln  LNK
217       200                    Concord  NaN

[218 rows x 3 columns]

In [25]:
df_s.Code.unique().__len__()

198

In [ ]:
df_sp = df.sample(frac=0.05)
df_sp.info()

In [ ]:
1111
1111
0101
1010
1